Revit 2024 API
EditorInteraction Constructor (EditorInteractionType)
 Construct the interaction with the specified type.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public EditorInteraction(
	EditorInteractionType interactionType
)
Visual Basic
Public Sub New ( _
	interactionType As EditorInteractionType _
)
Visual C++
public:
EditorInteraction(
	EditorInteractionType interactionType
)
Parameters
interactionType
Type: Autodesk.Revit.UI.EditorInteractionType
See Also
EditorInteraction Class
EditorInteraction Overload
Autodesk.Revit.UI Namespace